app/controllers/lottery_tickets_controller.rb

  def create
    @lottery_ticket = LotteryTicket.new(lottery_ticket_params)

    respond_to do |format|
      if @lottery_ticket.save
---
INSERT INTO "lottery_tickets" ("name", "force", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kappa"], ["force", 1000], ["created_at", 2016-10-30 14:34:05 UTC], ["updated_at", 2016-10-30 14:34:05 UTC]]

    def set_lottery_ticket
      @lottery_ticket = LotteryTicket.find(params[:id])
---
SELECT  "lottery_tickets".* FROM "lottery_tickets" WHERE "lottery_tickets"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]