app/controllers/visitors_controller.rb

  def index
    @lottery_tickets = LotteryTicket.all
---
SELECT "lottery_tickets".* FROM "lottery_tickets"