app/controllers/visitors_controller.rb

SELECT "lottery_tickets".* FROM "lottery_tickets" WHERE "lottery_tickets"."id" IN (29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40)
---
  def index
    @lottery_tickets = params[:lottery_tickets] ? LotteryTicket.find(params[:lottery_tickets]) : LotteryTicket.limit(12).to_a